app/Models/SettingsModel.php

SELECT *
FROM `cs_settings`
---
    function getSettings()
    {
        $this->select('*');
        $result = $this->get()->getRow();